cask_args appdir: "/Applications"

tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
# tap "sanemat/font"
# tap "smudge/smudge"

brew "git"
# brew "gitmoji"  # nodeの最新版を勝手に入れてくるので、一旦使用中止
brew "git-secrets"
# brew "heroku"
brew "jq"
brew "vim"
brew "mas"
brew "rename"
# brew "ricty"
# brew "rsync"
brew "shellcheck"
brew "tflint"
brew "tfsec"
brew "tree"
brew "volta"
# brew "watch"
brew "watchman"
brew "wget"

cask "alfred"
cask "appcleaner"
cask "aws-vault"
# cask "bettertouchtool"
cask "canva"
cask "cheatsheet"
cask "chromium"
cask "clipy"
cask "deepl"
cask "discord"
cask "docker"
cask "figma"
cask "goland"
# cask "google-chrome"
# cask "google-drive"
# cask "google-japanese-ime"
cask "hiddenbar"
# cask "iterm2"
cask "karabiner-elements"
# cask "monitorcontrol"
cask "ngrok"
cask "notion"
cask "postman"
cask "rectangle"
cask "sequel-ace"
# cask "simplenote"
# cask "skitch"
cask "slack"
# cask "sourcetree"
cask "react-native-debugger"
# cask "readdle-spark"
cask "the-unarchiver"
# cask "utm"
cask "visual-studio-code"
cask "warp"
cask "zoom"
cask "lastpass"

# mas "BetterSnapTool", id: 417375580
# mas "Gapplin", id: 768053424
# mas "GarageBand", id: 682658836
# mas "iMovie", id: 408981434
# mas "Keynote", id: 409183694
# mas "LINE", id: 539883307
# mas "Notability", id: 360593530
# mas "Numbers", id: 409203825
# mas "Pages", id: 409201541
# mas "PicGIF Lite", id: 844918735
# mas "RunCat", id: 1429033973
# mas "Spark", id: 1176895641
# mas "Xcode", id: 497799835